title: Possible preparation for libngs.dll DLL Hijacking
id: 5819402b-5039-48a3-6342-5b9ff8298918
status: experimental
description: Detects possible DLL hijacking of libngs.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/sangfor/libngs.html
author: "Swachchhanda Shrawan Poudel"
date: 2026-01-28
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\libngs.dll'
    filter:
        TargetFileName:
            - 'c:\program files\Sangfor\SSL\RemoteAppClient\\*'
            - 'c:\program files (x86)\Sangfor\SSL\RemoteAppClient\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

