title: Possibly malicious versions of libsmartscreenn.dll
id: 8778333b-2788-48a3-7807-5b9ff8401123
status: experimental
description: Detects possible DLL hijacking of libsmartscreenn.dll by looking for versions not meeting the known signature data.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/libsmartscreenn.html
author: "Still Hsu"
date: 2025-12-12
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: image_load
detection:
    selection:
        ImageLoaded: '*\libsmartscreenn.dll'
    filter:
        ImageLoaded:
            - Signed: 'true'
            - SignatureStatus: 'signed'
            - Signature|contains:
                - 'CN=Microsoft Corporation,O=Microsoft Corporation,L=Redmond,ST=Washington,C=US'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

